In [2]:
# Import Dependencies
import numpy as np
import pandas as pd
import psycopg2
import sqlalchemy
from sqlalchemy import create_engine

In [7]:
# Read excel file and load into pandas dataframe
sales_df = pd.read_excel('data/superstore.xls')
sales_df.head(2)

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
0,1,CA-2016-152156,2016-11-08,2016-11-11,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420,South,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.96,2,0.0,41.9136
1,2,CA-2016-152156,2016-11-08,2016-11-11,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420,South,FUR-CH-10000454,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.94,3,0.0,219.5820

In [8]:
# Renaming the column names
sales_df.rename(columns={'Row ID':'row_id', 'Order ID':'order_id', 'Order Date':'order_date',
                        'Ship Date':'ship_date','Ship Mode':'ship_mode','Customer ID':
                        'customer_id', 'Customer Name':'customer_name','Segment':'segment',
                         'Country':'country','City':'city','State':'state','Postal Code':'postal_code',
                         'Region':'region','Product ID':'product_id','Category':'category',
                         'Sub-Category':'sub_category','Product Name':'product_name','Sales':'sales',
                        'Quantity':'quantity','Discount':'discount','Profit':'profit'}, inplace=True)

In [9]:
# Split name into first name, middle name, last name.
sales_df[['first_name', 'last_name', 'middle_name']] = sales_df.customer_name.str.split(expand=True)
sales_df.head(2)

,row_id,order_id,order_date,ship_date,ship_mode,customer_id,customer_name,segment,country,city,...,category,sub_category,product_name,sales,quantity,discount,profit,first_name,last_name,middle_name
0,1,CA-2016-152156,2016-11-08,2016-11-11,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.96,2,0.0,41.9136,Claire,Gute,None
1,2,CA-2016-152156,2016-11-08,2016-11-11,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.94,3,0.0,219.5820,Claire,Gute,None

In [15]:
# Understand the data structure
sales_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9994 entries, 0 to 9993
Data columns (total 24 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   row_id         9994 non-null   int64
 1   order_id       9994 non-null   object
 2   order_date     9994 non-null   datetime64[ns]
 3   ship_date      9994 non-null   datetime64[ns]
 4   ship_mode      9994 non-null   object
 5   customer_id    9994 non-null   object
 6   customer_name  9994 non-null   object
 7   segment        9994 non-null   object
 8   country        9994 non-null   object
 9   city           9994 non-null   object
 10  state          9994 non-null   object
 11  postal_code    9994 non-null   int64
 12  region         9994 non-null   object
 13  product_id     9994 non-null   object
 14  category       9994 non-null   object
 15  sub_category   9994 non-null   object
 16  product_name   9994 non-null   object
 17  sales          9994 non-null   float64
 18  quantity       9994 non-null   int64
 19  discount       9994 non-null   float64
 20  profit         9994 non-null   float64
 21  first_name     9994 non-null   object
 22  last_name      9986 non-null   object
 23  middle_name    73 non-null     object
dtypes: datetime64[ns](2), float64(3), int64(3), object(16)
memory usage: 1.8+ MB

In [16]:
# Check whether any duplicate value or null values
print(sales_df.isna().sum())
print(sales_df.duplicated().sum())

row_id              0
order_id            0
order_date          0
ship_date           0
ship_mode           0
customer_id         0
customer_name       0
segment             0
country             0
city                0
state               0
postal_code         0
region              0
product_id          0
category            0
sub_category        0
product_name        0
sales               0
quantity            0
discount            0
profit              0
first_name          0
last_name           8
middle_name      9921
dtype: int64
0

In [17]:
# Connect postgresql database using create_engine
engine = create_engine('postgresql://postgres:postgres@localhost:5432/superstore_db')
conn = engine.connect()

In [18]:
# Load dataframe into sql database and name the table as 
sales_df.to_sql('sales', conn, if_exists='replace',index=False)

In [21]:
# SQL query to pandas dataframe
df = pd.read_sql_query("""SELECT * FROM sales""", conn)

In [20]:
# Finding aggregate of numeric feature values
df.describe()

,row_id,postal_code,sales,quantity,discount,profit
count,9994.000000,9994.000000,9994.000000,9994.000000,9994.000000,9994.000000
mean,4997.500000,55190.379428,229.858001,3.789574,0.156203,28.656896
std,2885.163629,32063.693350,623.245101,2.225110,0.206452,234.260108
min,1.000000,1040.000000,0.444000,1.000000,0.000000,-6599.978000
25%,2499.250000,23223.000000,17.280000,2.000000,0.000000,1.728750
50%,4997.500000,56430.500000,54.490000,3.000000,0.200000,8.666500
75%,7495.750000,90008.000000,209.940000,5.000000,0.200000,29.364000
max,9994.000000,99301.000000,22638.480000,14.000000,0.800000,8399.976000